Revit 2024 API
FailuresAccessor.CanRollBackPendingTransaction Method
 Checks if pending failure processing can be finished by rolling back a pending transaction.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public bool CanRollBackPendingTransaction()
Visual Basic
Public Function CanRollBackPendingTransaction As Boolean
Visual C++
public:
bool CanRollBackPendingTransaction()
Return Value
 True if there is a pending transaction and this transaction is allowed to be rolled back
Remarks
 Check makes sense only if the failure processing is pending.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.InvalidOperationException |  This FailuresAccessor is inactive (is used outside of failures processing).
See Also
FailuresAccessor Class
Autodesk.Revit.DB Namespace